{
  "core_exploration": {
    "central_question": "How do I quickly identify partners who will genuinely add value versus those who are just selling?",
    "key_tension": "The contradiction between traditional sales approaches (pitch first) and what actually builds trust (educate first)",
    "breakthrough_moment": "Realizing that the desire to 'steal' someone's knowledge is the clearest signal of their competence and partnership potential",
    "edge_of_understanding": "How to systematically apply this two-minute intuitive assessment across different domains and contexts"
  },
  "conceptual_dna": [
    "The best partners make you want to steal their knowledge within the first two minutes",
    "Education-first approaches build trust faster than credentials or team introductions",
    "Curiosity about someone's expertise is the most reliable indicator of their actual competence",
    "Results and knowledge demonstration trump team presentations and traditional pitches"
  ],
  "pattern_signature": {
    "thinking_style": [
      "intuitive-emergent",
      "experimental-iterative",
      "analytical-linear"
    ],
    "insight_type": "methodology",
    "development_stage": "breakthrough",
    "confidence_level": 0.8
  },
  "bridge_potential": {
    "domains_connected": [
      "business_strategy",
      "relationships",
      "psychology",
      "leadership"
    ],
    "novel_synthesis": "Combining intuitive partner assessment with systematic knowledge-demonstration evaluation",
    "cross_domain_pattern": "Competence signals through knowledge-sharing behavior rather than credential presentation"
  },
  "genius_indicators": {
    "uniqueness_score": 0.7,
    "depth_score": 0.7,
    "generative_potential": 0.8,
    "framework_emergence": 0.7
  },
  "raw_essence": "The best business partners reveal themselves in the first two minutes by making you curious about their knowledge rather than impressed by their credentials. True expertise manifests as education-first approaches that build trust through demonstrated competence rather than traditional sales pitches.",
  "embedding_text": "partner selection two-minute test knowledge curiosity expertise demonstration education-first sales approach competence signals trust building business relationships"
}